##
##  WPM-LMTT.R  (Local Mime Translation Table)
##  Copyright (c) 1994, David Harris, All Rights Reserved.
##
##  This file can be used as a model for a local resource which
##  maps ISO character sets to the code pages in use on the PCs
##  at your site.
##
##  Character translation tables:
##  Each translation table maps the characters in a particular
##  ISO set to your codepage's character set: the table can be used
##  bidirectionally when composing or decoding quoted-printable or
##  8BIT messages. Only characters from 128-255 are included in
##  the table, and each table must end with an ASCII NUL (0).
##
##  The sample tables in this file are the ones Pegasus Mail uses
##  by default: they map ISO character sets to the standard IBM
##  code page 437. You may define as many character sets as you
##  wish and Pegasus Mail will use them to translate incoming mail
##  but for outgoing mail it will only use ISO character sets.
##
##  The last resource in the file must be a "charset_list"
##  structure which ties the character strings naming an ISO
##  character set to the resource which maps it.
##
##  Angepaßt an deutsche Umlaute (cp_win) am 28-04-2004 Sven Henze
##
#==========================================================
#
#   OPTIMAL CHARACTER TRANSLATIONS, should be used as
#   a example for user defined tables in multilanguage fonts
#   environment.
#
# WEST   ISO-8859-1 -->   CP 1252
# CE     ISO-8859-2 -->   CP 1250
# TR,AFR ISO-8859-3 --> ? CP 1252
# BALTIC ISO-8859-4 -->   CP 1257
# CYR    ISO-8859-5 -->   CP 1251
# ARAB   ISO-8859-6 -->   CP 1256
# GREEK  ISO-8859-7 -->   CP 1253
# HEBR   ISO-8859-8 -->   CP 1255
# TR     ISO-8859-9 -->   CP 1254
# RUSS   KOI-8R     -->   CP 1251
# VIETN                   CP 1258 (currently not implemented)
#        ISO-8859-10      ???     (currently not implemented)
#   Conversion tables from Jiri Kuchta, 8-12-96, kuchta@fee.vutbr.cz
#
#=========================================================
##
##  To use this file, modify it as required, then compile it with
##  the Pegasus Mail system resource compiler, RESCOM, using the
##  command 'rescom PM-LMTT.R'. This will produce the file
##  PM-LMTT.RSC, which should be copied into the same directory
##  as PMAIL.EXE, or into your home mailbox.

##
##  The "charset_list" type is used to tie a particular name of
##  a character set to the table used to decode it.
##

typedef charset_list 25
   {
   repeat,
   string 20,     # Character set name
   integer        # resource ID of table to load.
   };


###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 1     (Latin 1)
###----------------------------------------------------------------
## Danish, Dutch, English, Faeroese, Finnish, French, German, Icelandic,
## Irish, Italian, Norwegian, Portuguese, Spanish and Swedish.
##
## optimal conversion into CP850, CP1252

structure iso8859_1
	{
# conversion ISO-1 --> 1252
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', '¡', '¢', '£', '¤', '¥', '|', '§',      #a0
	'¨', '©', 'ª', '«', '¬', '­', '®', '–',      #a8
   '°', '±', '²', '³', '´', 'µ', '¶', '·',      #b0
	'¸', '¹', 'º', '»', '¼', '½', '¾', '¿',      #b8
   'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',      #c0
	'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #c8
   'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',      #d0
   'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',      #d8
   'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',      #e0
   'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #e8
   'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',      #f0
   'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ',      #f8
   0
	};

###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 2     (Latin 2)
###----------------------------------------------------------------
## Albanian, Czech, English, German, Hungarian, Polish, Rumanian,
## Serbo-Croatian, Slovak, Slovene and Swedish.
##
## optimal conversion into CP852, CP1250

#structure iso8859_2
#   {
## conversion ISO-2 --> 1252 (WEST)
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
#'\160', 'A', '˜', 'L', '¤', 'L', 'S', '§',      #a0
#   '¨', 'Š', 'S', 'T', 'Z', '­', 'Z', 'Z',      #a8
#   '°', 'a', '?', 'l', '´', 'l', 's', 'ˆ',      #b0
#   '¸', 'š', 's', 't', 'z', '¨', 'z', 'z',      #b8
#   'R', 'Á', 'Â', 'Ã', 'Ä', 'L', 'C', 'Ç',      #c0
#   'C', 'É', 'E', 'Ë', 'Ê', 'Í', 'Î', 'D',      #c8
#   'Ð', 'N', 'Ñ', 'Ó', 'Ô', 'Ö', 'Ö', '×',      #d0
#   'R', 'Û', 'Ú', 'Ü', 'Ü', 'Ý', 'T', 'ß',      #d8
#   'r', 'á', 'â', 'ã', 'ä', 'l', 'c', 'ç',      #e0
#   'c', 'é', 'e', 'ë', 'ê', 'í', 'î', 'd',      #e8
#   'ð', 'n', 'ñ', 'ó', 'ô', 'ö', 'ö', '÷',      #f0
#   'r', 'û', 'ú', 'ü', 'ü', 'ý', 't', '·',      #f8
#   0
#   };

structure iso8859_2
   {
# conversion ISO-2 --> 1250 (CE)
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', '¥', '¢', '£', '¤', '¼', 'Œ', '§',      #a0
	'¨', 'Š', 'ª', '', '', '­', 'Ž', '¯',      #a8
	'°', '¹', '²', '³', '´', '¾', 'œ', '¡',      #b0
	'¸', 'š', 'º', '', 'Ÿ', '½', 'ž', '¿',      #b8
   'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',      #c0
	'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #c8
   'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',      #d0
	'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',      #d8
   'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',      #e0
   'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #e8
   'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',      #f0
   'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', '·',      #f8
   0
   };

###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 3     (Latin 3)
###----------------------------------------------------------------
## Afrikaans, Catalan, English, Esperanto, French, Galician, German,
## Italian, Maltese and Turkish.
##
## optimal conversion into CP85x, CP125x

structure iso8859_3
	{
# conversion ISO-3 --> 1252
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', 'H', '¯', '£', '¤', ' ', 'H', '§',      #a0
	'¨', 'I', 'S', 'G', 'J', '­', ' ', 'Z',      #a8
	'°', 'h', '²', '³', '´', 'µ', 'h', '·',      #b0
	'¸', 'i', 's', 'g', 'j', '½', ' ', 'z',      #b8
	'À', 'Á', 'Â', ' ', 'Ä', 'C', 'C', 'Ç',      #c0
	'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #c8
	' ', 'Ñ', 'Ò', 'Ó', 'Ô', 'G', 'Ö', '×',      #d0
	'G', 'Ù', 'Ú', 'Û', 'Ü', 'U', 'Š', 'ß',      #d8
   'à', 'á', 'â', ' ', 'ä', 'c', 'c', 'ç',      #e0
	'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #e8
   ' ', 'ñ', 'ò', 'ó', 'ô', 'g', 'ö', '÷',      #f0
   'g', 'ù', 'ú', 'û', 'ü', 'u', 'š', 'ÿ',      #f8
  0
   };

###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 4     (Latin 4)
###----------------------------------------------------------------
## Danish, English, Estonian, Finnish, German, Greenlandic, Lappish,
## Latvian, Lithuanian, Norwegian and Swedish.
##
## optimal conversion into CP85x, CP1257


#structure iso8859_4
#   {
## conversion ISO-4 --> 1252
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
#'\160', 'A', 'k', 'R', '¤', 'I', 'L', '§',      #a0
#   '¨', 'Š', 'Ê', 'G', 'T', '­', 'Z', '¯',      #a8
#   '°', 'a', '‚', 'r', '´', 'N', 'z', 'n',      #b0
#   '¸', 'š', 'ê', 'g', 't', 'i', 'l', '¿',      #b8
#   'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'I',      #c0
#   'C', 'É', 'E', 'Ë', 'È', 'Í', 'Î', 'Ï',      #c8
#   'Ð', 'Ñ', 'Ò', 'K', 'Ô', 'Õ', 'Ö', '×',      #d0
#   'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'U', 'U', 'ß',      #d8
#   'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'i',      #e0
#   'c', 'é', 'e', 'ë', 'è', 'í', 'î', 'ï',      #e8
#   'ð', 'ñ', 'ò', 'k', 'ô', 'õ', 'ö', '÷',      #f0
#   'ø', 'ù', 'ú', 'û', 'ü', 'u', 'u', '´',      #f8
#   0
#   };

structure iso8859_4
	{
# conversion ISO-4 --> 1257
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', 'À', 'k', 'ª', '¤', 'I', 'Ï', '§',      #a0
	'', 'Ð', 'Ç', 'Ì', 'T', '­', 'Þ', '',      #a8
	'°', 'à', 'ž', 'º', '´', 'i', 'ï', 'Ž',      #b0
	'', 'ð', 'ç', 'ì', 't', '?', 'þ', '?',      #b8
	'Â', 'A', 'A', 'A', 'Ä', 'Å', '¯', 'Á',      #c0
	'È', 'É', 'Æ', 'E', 'Ë', 'I', 'I', 'Î',      #c8
	'D', 'Ò', 'Ô', 'Í', 'O', 'Õ', 'Ö', '×',      #d0
	'Ø', 'U', 'U', 'Ü', 'U', 'U', 'Û', 'ß',      #d8
	'â', 'a', 'a', 'a', 'ä', 'å', '¿', 'á',      #e0
	'è', 'é', 'æ', 'e', 'ë', 'i', 'i', 'î',      #e8
	'd', 'ò', 'ô', 'í', 'o', 'õ', 'ö', '÷',      #f0
	'ø', 'u', 'u', 'ü', 'u', 'u', 'û', 'ÿ',      #f8
   0
   };

###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 5     (Cyrilic)
###----------------------------------------------------------------
## Bulgarian, Bielorussian, English, Macedonian, Russian,
## Serbo-Croatian and Ukrainian.
##
## optimal conversion into CP855, CP866, CP1251


#structure iso8859_5
#   {
## conversion ISO-5--> 1252
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
#'\160', 'Ë', '?', 'r', 'E', 'S', 'I', 'Ï',      #a0
#   'J', 'L', 'H', '?', 'K', '-', 'Ÿ', '?',      #a8
#   'A', 'B', 'V', 'G', 'D', 'E', 'Z', '3',      #b0
#   'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P',      #b8
#   'R', 'S', 'T', 'U', 'Ø', 'X', 'C', 'Ç',      #c0
#   'S', 'S', '?', '?', '?', '3', 'Ü', 'Ä',      #c8
#   'a', 'b', 'v', 'g', 'd', 'e', 'z', '3',      #d0
#   'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p',      #d8
#   'r', 's', 't', 'u', 'ø', 'x', 'c', 'ç',      #e0
#   's', 's', '?', '?', '?', '3', 'ü', 'ä',      #e8
#   'ª', 'ë', '?', 'r', 'e', 's', 'i', 'ï',      #f0
#   'j', 'l', 'h', '?', 'k', ' ', 'ÿ', '?',      #f8
#   0
#   };


structure iso8859_5
   {
# conversion ISO-5 --> 1251
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', '¨', '€', '', 'ª', '½', '²', '¯',      #a0
	'£', 'Š', 'Œ', 'Ž', '', '­', '¡', '',      #a8
	'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',      #b0
	'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #b8
	'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',      #c0
	'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',      #c8
	'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',      #d0
	'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #d8
	'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',      #e0
	'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ',      #e8
	'¹', '¸', '', 'ƒ', 'º', '¾', '³', '¿',      #f0
	'¼', 'š', 'œ', 'ž', '', ' ', '¢', 'Ÿ',      #f8
   0
   };

###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 6     (Arabic)
###----------------------------------------------------------------
## This set of graphic character is intended for use in information
## interchange as well as in data and text processing applications
## where both the Arabic and the Latin scripts are used.
##
## optimal conversion into CP85x, CP1256

#structure iso8859_6
#   {
## conversion ISO-6--> 1252
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
#'\160', ' ', ' ', ' ', '¤', ' ', ' ', ' ',      #a0
#   ' ', ' ', ' ', ' ', '`', '-', ' ', ' ',      #a8
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #b0
#   ' ', ' ', ' ', ';', ' ', ' ', ' ', '¨',      #b8
#   ' ', '?', '?', '?', '?', '?', '?', '?',      #c0
#   '?', '?', '?', '?', '?', '?', '?', '?',      #c8
#   '?', '?', '?', '?', '?', '?', '?', '?',      #d0
#   '?', '?', '?', ' ', ' ', ' ', ' ', ' ',      #d8
#   '-', '?', '?', '?', '?', '?', '?', '?',      #e0
#   '?', '?', '?', '-', '-', '-', '-', '-',      #e8
#   '-', '-', '-', ' ', ' ', ' ', ' ', ' ',      #f0
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #f8
#   0
#   };


structure iso8859_6
	{
## conversion ISO-6--> 1256
	' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',         #80
	' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',         #88
	' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',         #90
	' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',         #98
	'\160',' ',   ' ',   ' ',   '¤',   ' ',   ' ',   ' ',         #a0
	' ',   ' ',   ' ',   ' ',   '\161','\173',' ',   ' ',         #a8
	' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',         #b0
	' ',   ' ',   ' ',   '\186',' ',   ' ',   ' ',   '\191',      #b8
	' ',   '\193','\194','\195','\196','\197','\198','\199',      #c0
	'\200','\201','\202','\203','\204','\205','\206','\207',      #c8
	'\208','\209','\210','\211','\212','\213','\214','\216',      #d0
	'\217','\218','\219',' ',   ' ',   ' ',   ' ',   ' ',         #d8
	'\220','\221','\222','\223','\225','\227','\228','\229',      #e0
	'\230','\236','\237','\240','\241','\242','\243','\245',      #e8
	'\246','\248','\250',' ',   ' ',   ' ',   ' ',   ' ',         #f0
	' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',   ' ',         #f8
	0
   };

###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 7     (Greek)
###----------------------------------------------------------------
## This set is suited for multiple-language applications involving the
## Latin and the Greek scripts. It allows handling of data and text
## expressed in Greek.
##
## optimal conversion into CP85x, CP1253

structure iso8859_7
	{
## conversion ISO-7--> 1253
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', ',', '`', '£', ' ', ' ', '¦', '§',      #a0
	'¨', '©', ' ', '«', '¬', '­', ' ', '¯',      #a8
	'°', '±', '²', '³', '´', '¡', '¢', '·',      #b0
   '¸', '¹', 'º', '»', '¼', '½', '¾', '¿',      #b8
   'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',      #c0
   'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #c8
   'Ð', 'Ñ', ' ', 'Ó', 'Ô', 'Õ', 'Ö', '×',      #d0
   'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',      #d8
   'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',      #e0
   'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #e8
   'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',      #f0
   'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', ' ',      #f8
	0
   };

###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 8     (Hebrew)
###----------------------------------------------------------------
## This set is suited for multiple-language applications involving the
## Latin and the Hebrew scripts. It allows handling of data and text
## expressed in Hebrew.
##
## optimal conversion into CP85x, CP1255

#structure iso8859_8
#   {
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
#'\160', ' ', '¢', '£', '¤', '¥', '¦', '§',      #a0
#   '¨', '©', '×', '«', '¬', '­', '®', '?',      #a8
#	 '°', '±', '²', '³', '´', 'µ', '¶', '·',      #b0
#	 ',', '¹', '÷', '»', '¼', '½', '¾', ' ',      #b8
#	 ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #c0
#	 ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #c8
#	 ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #d0
#	 ' ', ' ', ' ', ' ', ' ', ' ', ' ', '?',      #d8
#   '?', '?', '?', '?', '?', '?', '?', '?',      #e0
#   '?', '?', '?', '?', '?', '?', '?', '?',      #e8
#   '?', '?', '?', '?', '?', '?', '?', '?',      #f0
#   '?', '?', '?', '?', '?', '?', '?', '?',      #f8
#   0
#   };


structure iso8859_8
   {
## conversion ISO-8--> 1255
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', ' ', '¢', '£', '¤', '¥', '¦', '§',      #a0
	'¨', '©', 'x', '«', '¬', '­', '®', '?',      #a8
	'°', '±', '²', '³', '´', 'µ', '¶', '·',      #b0
	',', '¹', '/', '»', '¼', '½', '¾', ' ',      #b8
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #c0
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #c8
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #d0
	' ', ' ', ' ', ' ', ' ', ' ', ' ', '?',      #d8
	'\224','\225','\226','\227','\228','\229','\230','\231',      #e0
	'\232','\233','\234','\235','\236','\237','\238','\239',      #e8
	'\240','\241','\242','\243','\244','\245','\246','\247',      #f0
	'\248','\249','\250',' ',   ' ',   ' ',   ' ',   ' ',         #f8
	0
	};


###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 9     (Latin 5)
###----------------------------------------------------------------
## English, Finnish, French, German, Irish, Italian, Norwegian,
## Portuguese, Spanish and Swedish and Turkish.
##
## optimal conversion into CP85x, CP1254


#structure iso8859_9
#   {
## conversion ISO-9 --> 1252
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
#   ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
#'\160', '¡', '¢', '£', '¤', '¥', '|', '§',      #a0
#   '¨', '©', 'ª', '«', '¬', '­', '®', '–',      #a8
#   '°', '±', '²', '³', '´', 'µ', '¶', '·',      #b0
#   '¸', '¹', 'º', '»', '¼', '½', '¾', '¿',      #b8
#   'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',      #c0
#   'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #c8
#   'G', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',      #d0
#   'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'I', 'S', 'ß',      #d8
#   'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',      #e0
#   'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #e8
#   'g', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',      #f0
#   'ø', 'ù', 'ú', 'û', 'ü', 'i', 's', 'ÿ',      #f8
#   0
#   };


structure iso8859_9
	{
# conversion ISO-9 --> 1254
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', '¡', '¢', '£', '¤', '¥', '¦', '§',      #a0
	'¨', '©', 'ª', '«', '¬', '­', '®', '¯',      #a8
	'°', '±', '²', '³', '´', 'µ', '¶', '·',      #b0
	'¸', '¹', 'º', '»', '¼', '½', '¾', '¿',      #b8
	'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',      #c0
	'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #c8
	'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',      #d0
	'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',      #d8
	'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',      #e0
	'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #e8
	'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',      #f0
	'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ',      #f8
	0
	};


###----------------------------------------------------------------
##                I S O - 8 8 5 9 - 1 5   (Latin 9)
###----------------------------------------------------------------
## Ajouté par Th. Thomas
## Albanais, allemand, anglais, basque, breton, catalan, danois, espagnol,
## estonien, féroïen, finnois, français, frison, gaélique écossais, gaélique
## irlandais (nouvelle orthographe), galicien, gallois, groenlandais,
## islandais, italien, latin, luxembourgeois, néerlandais, norvégien,
## portugais, romanche, suédois, et monégasque.
##
## optimal conversion into CP850, CP1252

structure iso8859_15
	{
# conversion ISO-15 --> 1252
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #80
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #88
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #90
	' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',      #98
'\160', '¡', '¢', '£', '€', '¥', 'Š', '§',      #a0
	'š', '©', 'ª', '«', '¬', '-', '®', '-',      #a8
   '°', '±', '²', '³', 'Ž', 'µ', '¶', '·',      #b0
	'ž', '¹', 'º', '»', 'Œ', 'œ', 'Ÿ', '¿',      #b8
   'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',      #c0
	'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',      #c8
   'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',      #d0
   'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',      #d8
   'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',      #e0
   'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',      #e8
   'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',      #f0
   'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ',      #f8
   0
	};


###----------------------------------------------------------------
##                K O I - 8 R             (Cyrilic)
###----------------------------------------------------------------
## Bulgarian, Bielorussian, English, Macedonian, Russian,
## Serbo-Croatian and Ukrainian.
##
## optimal conversion into CP855, CP866, CP1251

structure koi8_r
   {
# conversion KOI8-R --> 1251
	'-', '|', '+', '+', '+', '+', '|', '|',      #80
	'-', '-', '+', '#', '#', '#', '#', '#',      #88
	'#', '#', '#', '|', '#', '?', '?', '~',      #90
	'?', '?', ' ', '|', '?', '2', '.', '/',      #98
	'-', '|', '+', '¸', '+', '+', '+', '+',      #a0
	'+', '+', '+', '+', '+', '+', '+', '|',      #a8
	'|', '|', '|', '¨', '|', '|', '-', '-',      #b0
	'-', '-', '-', '-', '+', '+', '+', '©',      #b8
	'þ', 'à', 'á', 'ö', 'ä', 'å', 'ô', 'ã',      #c0
	'õ', 'è', 'é', 'ê', 'ë', 'ì', 'í', 'î',      #c8
	'ï', 'ÿ', 'ð', 'ñ', 'ò', 'ó', 'æ', 'â',      #d0
	'ü', 'û', 'ç', 'ø', 'ý', 'ù', '÷', 'ú',      #d8
	'Þ', 'À', 'Á', 'Ö', 'Ä', 'Å', 'Ô', 'Ã',      #e0
	'Õ', 'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î',      #e8
	'Ï', 'ß', 'Ð', 'Ñ', 'Ò', 'Ó', 'Æ', 'Â',      #f0
	'Ü', 'Û', 'Ç', 'Ø', 'Ý', 'Ù', '×', 'Ú',      #f8
   0
	};


###----------------------------------------------------------------
##                W I N D O W S - 1 2 X X
###----------------------------------------------------------------
##
## optimal conversion transparent

structure cp_WIN
#echo WIN transparent
   {
	'€', '?', '‚', 'ƒ', '„', '…', '†', '‡',
	'ˆ', '‰', 'Š', '‹', 'Œ', '?', 'Ž', '?',
	'?', ''', ''', '“', '”', '•', '-', '-',
	'˜', '™', 'š', '›', 'œ', '?', 'ž', 'Ÿ',
	' ', '¡', '¢', '£', '¤', '¥', '¦', '§',
	'¨', '©', 'ª', '«', '¬', '­', '®', '¯',
	'°', '±', '²', '³', '´', 'µ', '¶', '·',
	'¸', '¹', 'º', '»', '¼', '½', '¾', '¿',
	'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç',
	'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï',
	'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×',
	'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß',
	'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç',
	'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï',
	'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷',
	'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ',
      0
   };


charset_list _mime_csets
   {
   "ISO-8859-1",   iso8859_1,
   "ISO-8859-2",   iso8859_2,
   "ISO-8859-3",   iso8859_3,
   "ISO-8859-4",   iso8859_4,
   "ISO-8859-5",   iso8859_5,
   "ISO-8859-6",   iso8859_6,
   "ISO-8859-7",   iso8859_7,
   "ISO-8859-8",   iso8859_8,
   "ISO-8859-9",   iso8859_9,
   "ISO-8859-15",  iso8859_15,
   "KOI8-R",       koi8_r,
   "WINDOWS-1250", cp_WIN,      # Windows codepages transparent
   "WINDOWS-1251", cp_WIN,      #
   "WINDOWS-1252", cp_WIN,      #
   "WINDOWS-1253", cp_WIN,      #
   "WINDOWS-1254", cp_WIN,      #
   "WINDOWS-1257", cp_WIN,      #
   "", -1
   };

