<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
  <meta name="generator" content="HTML Tidy for Windows (vers 1st July 2003), see www.w3.org">
  <style type="text/css">
    body, td, li, p {font-family: sans-serif; font-size: 10pt; line-height: 13pt;}
  </style>

  <title>BearHtml Hilfe</title>
</head>

<body>
  <p><a name="top" id="top"></a></p>

  <h2><a href="http://www3.telus.net/public/irelam/">BearHtml</a> Hilfe</h2>

  <h4>Umschalt + F1 wechselt zwischen dieser Seite und der zuvor angezeigten Nachricht</h4>
  <hr width="100%">

  <h3>Inhalt</h3>

  <p><font size="2"><a href="#intro">Vorbemerkungen</a> | <a href="#keyboard">Tastenfunktionen</a> | <a href="#graphics">Bl&auml;ttern</a> | <a href="#printing">Ausdrucken</a> | <a href="#graphics">Bilderanzeige</a> | <a href="#styles">Formatierungen</a> | <a href="#fontsizing">Schriftformatierung</a> | <a href="#charsets">Zeichens&auml;tze</a> | <a href="#invalid">Fehlerhafter HTML-Code</a> | <a href="#suspicious">Verd&auml;chtiger HTML-Code</a> | <a href="#scripting">Aktiver HTML-Code</a> | <a href="#redirection">Adressenumleitung</a> | <a href="#proxy">Proxyserver</a> | <a href="#timeouts">Zeit&uuml;berschreitungen</a> | <a href="#logging">Fehlerprotokollierung</a> | <a href="#installation">Installation</a> | <a href="#uninstall">Deinstallation</a> | <a href="#bearini">Einstellungen</a> | <a href="#copyrights">Copyrights</a> | <a href="http://www3.telus.net/public/irelam/">Updates</a></font></p>

  <p><a name="intro" id="intro"></a></p>

  <h3>Vorbemerkungen</h3>

  <p>BearHtml ist ein Modul zur Darstellung von Internet(HTML)-Seiten, <b>kein Browser</b>. Die Anzeige solcher Seiten kann aus zwei Gr&uuml;nden scheitern:</p>

  <ol>
    <li>Fehlerhafte HTML-Codierung;</li>

    <li>Dynamische Seitenerzeugung (Scriptcode).</li>
  </ol>

  <p>In beiden F&auml;llen kann der Versuch unternommen werden, solche Dokumente mit Hilfe der rechten Maustaste &uuml;ber Pegasus Mail&#39;s Lesefenster-Kontextmen&uuml; im Webbrowser zu &ouml;ffnen.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="keyboard" id="keyboard"></a></p>

  <h3>Tastenfunktionen</h3>

  <table border="1" cellspacing="0" cellpadding="2">
    <tbody>
      <tr>
        <td>Seite auf-/abw&auml;rts</td>

        <td>bl&auml;ttert eine Seite auf-/abw&auml;rts</td>
      </tr>

      <tr>
        <td>Umschalttaste + Seite auf-/abw&auml;rts</td>

        <td>bl&auml;ttert und markiert eine Seite auf-/abw&auml;rts</td>
      </tr>

      <tr>
        <td>Pos1/Ende</td>

        <td>springt zu Zeilenanfang/-ende</td>
      </tr>

      <tr>
        <td>Umschalttaste + Pos1/Ende</td>

        <td>springt und markiert bis Zeilenanfang/-ende</td>
      </tr>

      <tr>
        <td>Umschalttaste + Strg + Pos1/Ende</td>

        <td>springt und markiert bis Textanfang/-ende</td>
      </tr>

      <tr>
        <td>Pfeiltaste links/rechts</td>

        <td>geht zum n&auml;chsten Buchstaben</td>
      </tr>

      <tr>
        <td>Umschalttaste + Pfeiltaste links/rechts</td>

        <td>geht und markiert bis zum n&auml;chsten Buchstaben</td>
      </tr>

      <tr>
        <td>Strg + Pfeiltaste links/rechts</td>

        <td>geht zum n&auml;chsten Wort</td>
      </tr>

      <tr>
        <td>Umschalttaste + Strg + Pfeiltaste links/rechts</td>

        <td>geht und markiert bis zum n&auml;chsten Wort</td>
      </tr>

      <tr>
        <td>Doppelklick</td>

        <td>markiert angeklicktes Wort</td>
      </tr>

      <tr>
        <td>Mausrad</td>

        <td>geht zur folgenden/vorhergehenden Zeile, <a href="#bearini">Einstellungen</a></td>
      </tr>

      <tr>
        <td>Pfeiltaste oben/unten</td>

        <td>geht zur folgenden/vorhergehenden Zeile</td>
      </tr>

      <tr>
        <td>Umschalttaste + Pfeiltaste oben/unten</td>

        <td>geht und markiert bis zur folgenden/vorhergehenden Zeile</td>
      </tr>

      <tr>
        <td>Umschalttaste + F8</td>

        <td>w&auml;hlt aktuelle Zeile aus</td>
      </tr>

      <tr>
        <td>Strg + C</td>

        <td>markierten Text in die Zwischenablage kopieren</td>
      </tr>

      <tr>
        <td>Strg + A</td>

        <td>alles markieren</td>
      </tr>

      <tr>
        <td>Leertaste</td>

        <td>bl&auml;ttert eine Seite nach unten</td>
      </tr>

      <tr>
        <td>Strg + Leertaste</td>

        <td>bl&auml;ttert eine Seite nach oben</td>
      </tr>

      <tr>
        <td>Strg + Seite auf-/abw&auml;rts</td>

        <td>versucht, Schriftgr&ouml;&szlig;e zu erh&ouml;hen/vermindern (<a href="#keys">*</a>)</td>
      </tr>

      <tr>
        <td>Ziffernblock: * bzw. &divide;</td>

        <td>versucht, Schriftgr&ouml;&szlig;e zu erh&ouml;hen/vermindern (<a href="#keys">*</a>)</td>
      </tr>

      <tr>
        <td>&quot;&lt;&quot; bzw. &quot;&gt;&quot;</td>

        <td>versucht, Schriftgr&ouml;&szlig;e zu erh&ouml;hen/vermindern (<a href="#keys">*</a>)</td>
      </tr>

      <tr>
        <td>Umschalttaste + Strg + P</td>

        <td>Dokument drucken</td>
      </tr>

      <tr>
        <td>Umschalttaste + Strg + R</td>

        <td>CSS an-/ausschalten</td>
      </tr>

      <tr>
        <td>Umschalttaste + Strg + U</td>

        <td>externe Bilder anzeigen</td>
      </tr>

      <tr>
        <td>Umschalttaste + Strg + Y</td>

        <td>L&ouml;scht den Pufferspeicher f&uuml;r externe Bilder</td>
      </tr>
    </tbody>
  </table>

  <p><a name="keys" id="keys">(*)</a> tastaturabh&auml;ngig</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="scrolling" id="scrolling"></a></p>
  <a name="intro"></a>

  <h3>Bl&auml;ttern</h3>

  <p>Es gibt zwei Arten, durch eine Webseite zu navigieren: Rollbalken an den R&auml;ndern des Anzeigefensters und Tastatureingaben. Bei Benutzung der Rollbalken werden die Seiten unabh&auml;ngig von der Position der Textmarke (oder -markierung) entsprechend der Bildschirmaufl&ouml;sung bewegt. Die Tastatursteuerung orientiert sich dagegen an der Buchstabenbreite und Zeilenh&ouml;he des jeweils dargestellten Inhalts, daher l&auml;&szlig;t sich die neue Position der Texmarke nicht immer exakt vorherbestimmen.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="printing" id="printing"></a></p>

  <h3>Ausdrucken</h3>

  <p>Zur Zeit k&ouml;nnen Daten aus BearHtml per <em>Umschalttaste + Strg + P</em> nur ohne die Infomationen aus dem Nachrichtenkopf gedruckt werden. Die Druckereinstellungen k&ouml;nnen ge&auml;ndert werden, wenn Sie <em>PrinterSetup=Yes</em> in <a href="#bearini">Bearhtml.ini</a> eintragen.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="graphics" id="graphics"></a></p>

  <h3>Bilderanzeige</h3>

  <p>Externe Bilder, die &uuml;ber&#39;s (Inter-)Netz nachgeladen werden m&uuml;ssen, werden als <img src="bearRmt.png" alt="Externes Bild nicht geladen"> angezeigt. Um solche Bilder anzeigen zu lassen, mu&szlig; entweder die Tastenkombination <em>Umschalttaste + Strg + U</em> bet&auml;tigt oder &uuml;ber das Kontextmen&uuml; (rechte Maustaste innerhalb des Lesefensters bet&auml;tigen) der Eintrag <em>Bilder anzeigen (nur HTML)</em> ausgew&auml;hlt werden, sofern in Pegasus Mail unter <em>Extras | Einstellungen | Nachrichtenanzeige</em> nicht <em>Automatisch, wenn Internetverbindung besteht</em> f&uuml;r die Anzeige externer Bilder eingestellt ist.<br>
  W&auml;hrend des Ladens der Bilder erscheint in Pegasus Mail&#39;s Statuszeile (unten links) ein Countdown, der &uuml;ber den Verlauf des Herunterladens informiert. Versuchen Sie nicht, eine Nachricht zu schlie&szlig;en, bevor das Herunterladen beendet ist. Im Falle fehlerhafter oder unvollst&auml;ndig geladener Bilddaten erscheint ein kleines gelbes Ausrufezeichen <img src="beargrfn.png" alt="Externes Bild nicht verf&uuml;gbar"> innerhalb des Bildrahmens.<br>
  Wenn Sie <em>WantCache=yes</em> in <a href="#bearini">BearHtml.ini</a> eingestellt haben, dann werden Kopien der einmal geladenenen Bilddateien &uuml;ber einen per <em>Cache-Days=&lt;Anzahl an Tagen&gt;</em> definierbaren Zeitraum gespeichert und bei nachfolgenden Anforderungen vom lokalen Rechner geladen. Dieser Zwischenspeicher kann jederzeit mit der Tastenkombination <em>Umschalttaste + Strg + Y</em> geleert werden.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="styles" id="styles"></a></p>

  <h3>Formatierungen</h3>

  <p>Momentan werden nur Formatierungen ber&uuml;cksichtigt, die sich innerhalb der jeweiligen Daten befinden. Externe Formatierungsdateien (<em>style sheets</em>) werden nicht heruntergeladen.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="fontsizing" id="fontsizing"></a></p>

  <h3>Schriftformatierung</h3>

  <p>Die Anpassung der Schriftgr&ouml;&szlig;en per Mausrad mag u.U. nicht immer funktionieren oder zu ungew&ouml;hnlichen Ergebnissen f&uuml;hren. Falls bereits innerhalb der Daten feste Schriftformatierungen definiert sind, &uuml;berschreiben diese etwaige Standardvorgaben, so da&szlig; es infolgedessen auch zu uneinheitlichen Darstellungen kommen kann. Beachten Sie, da&szlig; in obiger <a href="#keyboard">Tabelle</a> verschiedene Tasten(-kombinationen) mit ein- und derselben Funktion belegt sind.<br>
  Au&szlig;er einer Standard-Schriftart (<em>DefaultFontName</em>) und Standard-Schriftgr&ouml;&szlig;e (<em>DefaultFontSize</em>) k&ouml;nnen Sie in <a href="#bearini">BearHtml.ini</a> auch eine Standard-Schriftfarbe (<em>DefaultFontColor</em>) f&uuml;r nicht-vorformatierte Texte angeben, z.B. <font color="black">schwarz</font>, <font color="blue">blau</font>, <font color="teal">dunkel-t&uuml;rkis</font>, <font color="aqua">hell-t&uuml;rkis</font>.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="charsets" id="charsets"></a></p>

  <h3>Zeichens&auml;tze</h3>

  <p>HTML wird normalerweise mit dem Standardzeichensatz des gerade benutzten Systems angezeigt. Wenn Sie anstelle des erwarteten Textes wei&szlig;e Stellen vorfinden, ist das ein Hinweis darauf, da&szlig; bei der Erstellung ein anderer Zeichensatz verwendet wurde, ohne diesen im Quelltext korrekt anzugegeben. Nach &Ouml;ffnen eines solchen Textes im Browser &uuml;ber Pegasus Mail&#39;s Kontextmen&uuml;eintrag <em>In Webbrowser &ouml;ffnen</em> (rechte Maustaste innerhalb des Lesefensters bet&auml;tigen) k&ouml;nnen Sie verschiedene Zeichens&auml;tze (typischerweise im <em>Ansicht</em>-Men&uuml; des Browsers) ausprobieren und den AbsenderInnen der fehlerhaft kodierten Nachricht ggf. einen Korrekturhinweis geben.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="invalid" id="invalid"></a></p>

  <h3>Fehlerhafter HTML-Code</h3>

  <p>Wenn BearHtml Daten nicht anzeigen kann, wird mittels der Hilfbibliothek <em>LibTidy.dll</em> der Versuch unternommen, eine &quot;reparierte&quot; Fassung zu erstellen und anzuzeigen. Falls dieser Versuch scheitert und die Daten nicht automatisch korrigiert werden k&ouml;nnen, wird der HTML-Quellcode in&#39;s Lesefenster geladen. In solchen F&auml;llen wie auch bei fehlerhafter oder g&auml;nzlich fehlender Anzeige kann dann immer noch der Versuch unternommen werden, die Daten &uuml;ber Pegasus Mail&#39;s Kontextmen&uuml;eintrag <em>In Webbrowser &ouml;ffnen</em> in Ihrem Browser darstellen zu lassen (rechte Maustaste innerhalb des Lesefensters bet&auml;tigen).</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="suspicious" id="suspicious"></a></p>

  <h3>Verd&auml;chtiger HTML-Code</h3>

  <p>Links (URLs) innerhalb des HTML-Codes werden nach dem Anklicken daraufhin untersucht, ob sie m&ouml;glicherweise dazu mi&szlig;braucht werden k&ouml;nnten, von Ihnen pers&ouml;nliche Daten (Pa&szlig;w&ouml;rter, PINs etc.) zu erschleichen. Beispiele:</p>

  <ul>
    <li>Links mit numerischen IP-Adressen, z.B. <em>http://192.168.0.1</em>;</li>

    <li>Links, die in unlesbaren (Escape-)Kodierungen angegeben werden, z.B. <em>http://%37icrosoft.com</em>;</li>

    <li>Links, die andere Adressen als Tarnung benutzen, z.B. <em>http://www.goodsite.com@www.badsite.com</em>;</li>

    <li>Links, die im Text nicht mit ihrer eigentlichen Adresse erscheinen, z.B. der ber&uuml;chtigte <u><font color="#0000FF">klicken sie hier</font></u> - Link ...</li>
  </ul>

  <p>Dar&uuml;berhinaus werden Links mit den in <em>BearWarn.txt</em> enthaltenen und beim Blacklist-Service <a href="http://www.surbl.org">www.surbl.org</a> registrierten &quot;Phishing&quot;-verd&auml;chtigen Adressen verglichen: Sofern <a href="#bearini">BearHtml.ini</a> den Eintrag <em>WantBl=yes</em> enth&auml;lt, wird das Ergebnis der externen &Uuml;berpr&uuml;fung nach dem Anklicken des jeweiligen Links in Pegasus Mail&#39;s Statuszeile (unten links) angezeigt. Details k&ouml;nnen in <em>BearHtml.log</em> betrachtet werden, worin sich anhand der letzten Stelle einer IP-Adresse (nach dem Schema <em>127.0.0.n</em>) erkennen l&auml;&szlig;t, in welchen Listen die jeweilige Adresse verzeichnet ist. Dazu wird aus folgenden Werten die Summe gebildet:</p>

  <ul>
    <li>2 = sc.surbl.org</li>

    <li>4 = ws.surbl.org</li>

    <li>8 = mailsecurity.net.au, rhs.mailpolice.com, www.castlecops.com und AntiPhishing Working Group</li>

    <li>16 = ob.surbl.org</li>

    <li>32 = ab.surbl.org</li>

    <li>64 = jp data source</li>
  </ul>

  <p>Unter Umst&auml;nden werden Sie durch einen Warndialog auf problematische Links hingewiesen, und sofern Sie solche Warnungen nicht ignorieren, erscheint bei nachfolgendem &Uuml;berfahren der entsprechenden Links mit der Maus innerhalb derselben Pegasus-Mail-Sitzung ein Stopzeichen anstelle des Mauszeigers. Die Datei <em>BearWarn.txt</em> kann &uuml;brigens mit eigenen Eintr&auml;gen vervollst&auml;ndigt werden, Einzelheiten dazu finden Sie in der Datei.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="scripting" id="scripting"></a></p>

  <h3>Aktiver HTML-Code</h3>

  <p>Aktiver HTML-Code (JavaScript, JScript, VBScript etc.) wird aus Sicherheitsgr&uuml;nden ignoriert und nicht ausgef&uuml;hrt. Dies bringt u.U. Probleme bei der Darstellung entsprechender Daten mit sich, die ggf. &uuml;ber Pegasus Mail&#39;s Kontextmen&uuml;eintrag <em>In Webbrowser &ouml;ffnen</em> in einem externen Browser ge&ouml;ffnet werden sollten. Auch Versuche, Cookies abzufragen oder zu speichern, werden unterbunden.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="redirection" id="redirection"></a></p>

  <h3>Adressenumleitung</h3>

  <p>Das HTTP-Protokoll erlaubt die &Auml;nderung einer URL-Anfrage durch den Webserver, um Objekte (z.B. Seiten oder Bilder) von einem anderen Ort herunterzuladen. BearHtml kann dies auf Wunsch erlauben, es ist aber ratsam, das Einschalten dieser Option gut abzuw&auml;gen. Die Risiken zu beschreiben &uuml;berschreitet allerdings den Rahmen dieser Datei: Detaillierte Informationen finden sich z.B. in der <a href="http://de.wikipedia.org/wiki/Weiterleitung">Wikipedia</a> (die <a href="http://en.wikipedia.org/wiki/Url_redirection">englische Version</a> ist wesentlich informativer).</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="proxy" id="proxy"></a></p>

  <h3>Proxyserver</h3>

  <p>Sofern Workstations unter bestimmten Konfigurationen nicht direkt auf das Internet zugreifen d&uuml;rfen sondern einen Proxyserver benutzen m&uuml;ssen, kann ein solcher mitsamt des benutzten Ports unter <em>Proyserver=</em> in <a href="#bearini">BearHtml.ini</a> eingetragen werden. Falls die Benutzung des <em>Microsoft Internet Explorer</em> erlaubt ist, gelten dessen Werte, wie sie unter <em>Extras | Internetoptionen | Verbindungen | Einstellungen</em> angegeben sind (und von anderen Browsern ggf. &uuml;bernommen werden).</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="timeouts" id="timeouts"></a></p>

  <h3>Zeit&uuml;berschreitungen</h3>

  <p>BearHtml benutzt die Windows-Internet-Bibliothek <em>WinInet.dll</em> zur Abfrage von DNS-Eintr&auml;gen und zum Laden von Webseiten. Dabei kann es aufgrund hohen Verkehrsaufkommens oder durch Funktionsausf&auml;lle zu Verz&ouml;gerungen kommen, so da&szlig; weitere Anfragen (&uuml;blicherweise nach 60 Sekunden) nicht mehr durchgef&uuml;hrt werden. Sofern Ihnen dies zu lange dauert, k&ouml;nnen Sie in <a href="#bearini">BearHtml.ini</a> per <em>MaxFetchTime=&lt;Anzahl Sekunden&gt;</em> festlegen, wie lange Sie zu warten gewillt sind, bis BearHtml weitere Ladeversuche f&uuml;r die aktuelle Nachricht abbricht.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="logging" id="logging"></a></p>

  <h3>Fehlerprotokollierung</h3>

  <p>Um etwaige Probleme zu untersuchen, kann in Pegasus Mail&#39;s Verzeichnis f&uuml;r neue Emails eine Textdatei namens <em>BearHtml.log</em> angelegt werden, die Sie sich in einem normalen Textbetrachter wie Notepad anschauen k&ouml;nnen.<br>
  Wenn die Hilfsbibliothek <em>LibTidy.dll</em> zum Reparieren fehlerhaften HTML-Codes aufgerufen wurde und in <em>BearHtml.ini</em> der Wert <em>LogLevel=5</em> gesetzt ist, dann werden deren Warnungen und Fehlermeldungen in <em>BearHtml.log</em> eingetragen.</p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="installation" id="installation"></a></p>

  <h3>Installation</h3>

  <ol>
    <li>Schlie&szlig;en Sie Pegasus Mail.</li>

    <li>Entpacken Sie den Inhalt des neuen <em>BearHtml.zip</em>-Archivs in Pegasus Mail&#39;s Stammverzeichnis (dasjenige, in dem sich <em>winpm-32.exe</em> befindet).</li>

    <li>Falls n&ouml;tig, bearbeiten Sie <a href="#bearini">BearHtml.ini</a>.</li>

    <li>Starten Sie Pegasus Mail erneut.</li>
  </ol>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="uninstall" id="uninstall"></a></p>

  <h3>Deinstallation</h3>

  <ol>
    <li>Schlie&szlig;en Sie Pegasus Mail.</li>

    <li>Umbenennen, verschieben oder l&ouml;schen Sie <em>Bearhtml.dll</em>.</li>

    <li>Starten Sie Pegasus Mail erneut.</li>
  </ol>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="bearini" id="bearini"></a></p>

  <h3>Einstellungen</h3>

  <ul>
    <li><tt>ScrollPixels=</tt> (Standard 20; Pixelh&ouml;he f&uuml;r Mausradbewegung);</li>

    <li><tt>ScrollRepeat=</tt> (Standard 1; Wiederholungsrate f&uuml;r Mausradbewegung);</li>

    <li><tt>ScrollDelayMs=</tt> (Standard 1mSec; Verz&ouml;gerung zwischen Mausradbewegungen);</li>

    <li><tt>DefaultFontName=</tt> (Standard Arial; Schriftart);</li>

    <li><tt>DefaultFontSize=</tt> (Standard 12; Schriftgr&ouml;&szlig;e);</li>

    <li><tt>DefaultFontColor=</tt> (Standard schwarz; Schriftfarbe);</li>

    <li><tt>WantBl=</tt> (Standard No, Yes/No; Test auf Mitgliedschaft in einer Negativliste (Blacklist));</li>

    <li><tt>WantCache=</tt> (Standard No, Yes/No; speichere Grafikdaten in Dateien mit den Endungen <em>.Rmt</em> und <em>.Cac</em> im Verzeichnis <em>RmtFiles</em> unterhalb des jeweiligen Pegasus-Mail-Verzeichnisses f&uuml;r neue Nachrichten);</li>

    <li><tt>Cache-Days=</tt> (Standard 1; wenn WantCache eingeschaltet ist, dann gibt dieser Wert an, nach wievielen Tagen die gespeicherten Grafiken unabh&auml;ngig von Pegasus-Mail-Sitzungen gel&ouml;scht werden sollen; Null bedeutet &quot;f&uuml;r den Rest des angebrochenen Tages&quot;);</li>

    <li><tt>MaxFetchTime=</tt> (Standard 25; maximale individuell akzeptable Ladezeit in Sekunden);</li>

    <li><tt>LocalIPAddress=</tt> (kein Standard; kann benutzt werden um zu verhindern, dass lokale numerische Adressen &quot;Phishing&quot;-Warnungen ausl&ouml;sen; mehrere Adressen werden durch Kommas getrennt; <em>LocalIPAddress=127.0.0,192.168</em> w&uuml;rde z.B. <em>127.0.0.x</em> und <em>192.168.x.x</em> ausnehmen);</li>

    <li><tt>CheckUTF8=</tt> (Standard No; Test auf Vorhandensein eines UTF8-Zeichensatz-Mime-Headers);</li>

    <li><tt>Redirection=</tt> (Standard No; erlaubt HTTP-URL-Umleitungen zu anderen Adresse (riskant));</li>

    <li><tt>WarnExtensions=</tt> (Standard .EXE.SCR.PIF; suche nach riskanten Dateiendungen in URLs);</li>

    <li><tt>Proxyserver=</tt> (kein Standard; Beispieleintrag: <em>http://127.0.0.1:8080</em>);</li>

    <li><tt>Skype=</tt> (Pfadangabe zu Skype.exe; wird f&uuml;r <em>Callto:</em>- and <em>Skype:</em>-Links benutzt);</li>

    <li><tt>PrinterSetup=</tt> (Standard No; erlaubt Druckerauswahl zum Drucken von HTML- Seiten);</li>

    <li><tt>PrtFlags=</tt> (Standard 0; 1 = drucke Kopfeintr&auml;ge, 2 = drucke Fu&szlig;zeile mit Seitenzahl, 3 = drucke beides);</li>

    <li><tt>ShortInfo=</tt> (Standard Yes; verk&uuml;rzt die Linkanzeige in den Hinweisfensterchen auf die Domain)</li>

    <li><tt>UnloadWinInet=</tt> (Standard Yes; Entladen von WinInet.dll veranlassen)</li>

    <li>
      <tt>LogLevel=</tt> (Standard 3; benutzt dieselben Abstufungen wie Pegasus Mail unter <em>Extras | Einstellungen | Benachrichtigung =&gt; Logging</em>, d.h.:

      <table border="1" cellspacing="0" cellpadding="2">
        <tr>
          <td><tt>LogLevel=1</tt>: berichtet &uuml;ber kritische BearHtml- Funktionsst&ouml;rungen</td>
        </tr>

        <tr>
          <td><tt>LogLevel=2</tt>: berichtet zus&auml;tzlich &uuml;ber andere wichtige Probleme</td>
        </tr>

        <tr>
          <td><tt>LogLevel=3</tt>: berichtet zus&auml;tzlich &uuml;ber normale Ereignisse</td>
        </tr>

        <tr>
          <td><tt>LogLevel=4</tt>: erg&auml;nzt detaillierte Transaktions-Informationen</td>
        </tr>

        <tr>
          <td><tt>LogLevel=5</tt>: schlie&szlig;t HTML-Tidy-Warnungen und -Fehlermeldungen ein</td>
        </tr>
      </table>
    </li>
  </ul>

  <p><i>Windows-95-BenutzerInnen verf&uuml;gen nur &uuml;ber begrenzte Zeichensatz- Optionen und sollten daher &quot;CheckUTF8&quot; in <a href="#bearini">BearHtml.ini</a> auf &quot;No&quot; setzen.</i></p>

  <p align="right"><a href="#top">Seitenanfang</a></p>

  <p><a name="copyrights" id="copyrights"></a></p>

  <h3>Copyrights</h3>

  <ul>
    <li>HtmlViewer: David Baldwin ( <a href="http://www.pbear.com">http://www.pbear.com</a>)</li>

    <li>Pegasus Mail: David Harris ( <a href="http://www.pmail.com">http://www.pmail.com</a>)</li>

    <li>Tidy: LibTidy-Projekt( <a href="http://tidy.sourceforge.net">http://tidy.sourceforge.net</a> und <a href="http://www.w3c.org">http://www.w3c.org</a>)</li>

    <li>BearHtml: Martin Ireland ( <a href="mailto:martin.ireland@gov.ab.ca">mailto:martin.ireland@gov.ab.ca</a>)</li>

    <li>ReadWebData: Michael in der Wiesche</li>
  </ul>

  <p align="right"><a href="#top">Seitenanfang</a></p>
</body>
</html>
