<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title></title>
</head>
<body>
<h2>Aide BEARHTML 2.7.6</h2>
<h4>Maj + F1 bascule entre cette aide et le message
pr&eacute;c&eacute;demment
affich&eacute;</h4>
<h3>Mots cl&eacute;s</h3>
<table border="1">
  <tbody>
    <tr>
      <td>Pg Haut/Pg Bas</td>
      <td>D&eacute;cale d'une page vers le haut/bas</td>
    </tr>
    <tr>
      <td>Maj +&nbsp;Pg Haut/Pg Bas</td>
      <td>D&eacute;cale en s&eacute;lectionnant les pages</td>
    </tr>
    <tr>
      <td>D&eacute;but/Fin</td>
      <td>Va au d&eacute;but/&agrave; la fin de la ligne</td>
    </tr>
    <tr>
      <td>Maj +&nbsp;D&eacute;but/Fin</td>
      <td>Va au d&eacute;but/&agrave; la fin de la ligne en
s&eacute;lectionnant<br>
      </td>
    </tr>
    <tr>
      <td>Maj + Ctrl +&nbsp;D&eacute;but/Fin</td>
      <td>Va au d&eacute;but/&agrave; la fin du document en
s&eacute;lectionnant</td>
    </tr>
    <tr>
      <td>Fl&egrave;che Gauche/Droite<br>
      </td>
      <td>D&eacute;cale d'un caract&egrave;re</td>
    </tr>
    <tr>
      <td>Maj +&nbsp;Fl&egrave;che Gauche/Droite</td>
      <td>D&eacute;cale et s&eacute;lectionne par caract&egrave;re</td>
    </tr>
    <tr>
      <td>Ctrl +&nbsp;Fl&egrave;che Gauche/Droite</td>
      <td>D&eacute;cale d'un mot</td>
    </tr>
    <tr>
      <td>Maj + Ctrl +&nbsp;Fl&egrave;che Gauche/Droite&nbsp;</td>
      <td>D&eacute;cale et s&eacute;lectionne par mots</td>
    </tr>
    <tr>
      <td>Double Clic</td>
      <td>S&eacute;lection du mot en cours<br>
      </td>
    </tr>
    <tr>
      <td>Fl&egrave;che Haut/Bas</td>
      <td>D&eacute;cale d'une ligne</td>
    </tr>
    <tr>
      <td>Roulette de la souris</td>
      <td>D&eacute;cale d'une ligne (**)</td>
    </tr>
    <tr>
      <td>Maj +&nbsp;Fl&egrave;che Haut/Bas</td>
      <td>D&eacute;cale en s&eacute;lectionnant les lignes</td>
    </tr>
    <tr>
      <td>Maj + F8</td>
      <td>S&eacute;lectionne la ligne en cours</td>
    </tr>
    <tr>
      <td>Ctrl + C</td>
      <td>Copie le texte s&eacute;lectionn&eacute; dans le presse-papier</td>
    </tr>
    <tr>
      <td>Ctrl + A</td>
      <td>Tout s&eacute;lectionner</td>
    </tr>
    <tr>
      <td>Barre d'espace</td>
      <td>Descendre d'une page</td>
    </tr>
    <tr>
      <td>Ctrl +&nbsp;Barre d'espace</td>
      <td>Monter d'une page</td>
    </tr>
    <tr>
      <td>Ctrl +&nbsp;Roulette de la souris</td>
      <td>Diminue/Augmente la taille de la police (*)</td>
    </tr>
    <tr>
      <td>Pav&eacute; num&eacute;rique '/' (&divide;) ou '*'</td>
      <td>Diminue/Augmente la taille de la police (*)</td>
    </tr>
    <tr>
      <td>'&lt;' ou '&gt;'</td>
      <td>Diminue/Augmente la taille de la police (*)</td>
    </tr>
    <tr>
      <td>'Ctrl +&nbsp;Pg Bas/Pg Haut</td>
      <td>Diminue/Augmente la taille de la police (*)</td>
    </tr>
    <tr>
      <td>Maj + Ctrl + 'P'</td>
      <td>Imprime la page HTML seule</td>
    </tr>
    <tr>
      <td>Maj + Ctrl + 'U'</td>
      <td>Affiche les images distantes</td>
    </tr>
    <tr>
      <td>Maj + Ctrl + 'Y'</td>
      <td>Efface le cache d'images distantes</td>
    </tr>
  </tbody>
</table>
(*) &nbsp; Selon le type de clavier <br>
(**) Voir la d&eacute;finition du d&eacute;calage de la roulette de la
souris
dans Bearhtml.ini
<h3>Introduction.</h3>
Bearhtml est un visualiseur de pages HTML, <b>ce n'est pas un
navigateur</b>.
L'impossibilit&eacute; d'afficher une page peut provenir d'une des
raisons suivantes
:<br>
<ol>
  <li>Mauvais codage Html </li>
  <li>Codage dynamique (script) </li>
</ol>
Dans ces cas vous pouvez essayer de visualiser la page en choississant
"Visualiser
dans le navigateur" avec le clic droit
<h3>Graphiques</h3>
Les URL graphiques distantes sont affich&eacute;es <img
 src="bearRmt.png" alt="Graphique distant">
. Pour voir les graphiques distants, cliquez sur Shift + Ctrl + 'U ',
ou
faites un clic droit dans la zone du message (mais pas sur un
graphique)
et choisissez "Montrer les images", ou assurez-vous que l'option
Lecteur
de Message est positionn&eacute;e pour aller les chercher
automatiquement. Il y aura
un d&eacute;lai d'attente pendant la recherche des images. Pendant le
chargement
des images, un compteur montre la progression. Ne fermez pas le message
avant
que le compteur n'ait termin&eacute; le compte &agrave; rebours. <br>
Dans le cas de fichiers images corrompus ou tronqu&eacute;s une petite
fen&ecirc;tre
contenant un point d'exclamation <img src="bearGrfn.png"
 alt="Image corrompue"> s'affichera pour indiquer la pr&eacute;sence
d'une image non affichable. Les fichiers images invalides resteront
sous cette forme :&nbsp; <img src="bearRmt.png" alt="Image distante">
<h3>Html invalide</h3>
Si Bearhtml est incapable d'afficher un message en HTML cela
entra&icirc;ne
un appel &agrave; LibTidy pour tenter une r&eacute;paration. Une
tentative
sera faite pour afficher les images r&eacute;par&eacute;es. Si cela
&eacute;choue
le source html d'origine sera affich&eacute;. Une erreur &agrave; ce
moment
l&agrave; indique un message html de particuli&egrave;rement mauvaise
qualit&eacute;. Si l'affichage est vide ou de mauvaise qualit&eacute;,
choisir "Ouvrir dans
le navigateur" avec le clic droit de la souris. <br>
Vous voulez tenter le d&eacute;pannage par vous-m&ecirc;me ? Tout en
gardant
le message ouvert, lancez l'Explorateur Windows et rendez-vous dans
votre
dossier de fichiers temporaires (soit C:\Temp, C:\Windows\Temp ou
C:\Documents
and settings\nom_du_profil\Temp) et cherchez un fichier ayant un nom du
genre
WPM$1234.PM$ qui vient d'&ecirc;tre cr&eacute;&eacute;. Ouvrez-le avec
le
Bloc-Notes, il devrait contenir du code HTML. Sauvegardez-le en tant
que
fichier HTML, par exemple wpm$1234.htm puis ouvrez-le dans votre
navigateur
web.<br>
<h3>Jeux de caract&egrave;res</h3>
Le code HTML est affich&eacute; en utilisant le jeu de caract&egrave;re
normal
(c'est &agrave; dire ISO-8859-1). Si vous voyez des carr&eacute;s vides
l&agrave;
o&ugrave; le texte devrait &ecirc;tre affich&eacute;, c'est
l'indication
que l'exp&eacute;diteur utilise un jeu de caract&egrave;res
diff&eacute;rent.
Utilisez la m&ecirc;me m&eacute;thode de d&eacute;pannage que
ci-dessus,
mais une fois dans votre navigateur allez dans le menu <span
 style="font-style: italic;">Encodage des caract&egrave;res</span> (ou
toute autre appellation, l'emplacement d&eacute;pend du navigateur
utilis&eacute;) et s&eacute;lectionnez
une des m&eacute;thodes propos&eacute;es dans la liste. Si l'une de ces
m&eacute;thodes
permet de lire le message, vous devriez informer l'exp&eacute;diteur du
probl&egrave;me
de jeu de caract&egrave;res et lui indiquer le jeu convenable.
<br>
Windows 95 poss&egrave;de une gestion des jeux de caract&egrave;res
limit&eacute;e, pour corriger ce probl&egrave;me placez le
param&egrave;tre CheckUTF8 &agrave; <span style="font-style: italic;">false</span>
(CheckUTF8=false) dans le fichier Bearhtml.ini.<br>
<h3>Html suspect<br>
</h3>
La dangerosit&eacute; des URL sur lesquelles vous cliquez est
v&eacute;rifi&eacute;e,
par exemple les URL dangereuses qui vous demandent des informations
personnelles,
soit&nbsp;:
<ul>
  <li>V&eacute;rification des adresses IP num&eacute;riques comme
http://191.168.0.1 </li>
  <li>V&eacute;rification des liens vers 2 domaines, comme
http://www.bonsite.com@www.mauvaissite.com </li>
  <li>V&eacute;rification des liens trompeurs, c'est &agrave; dire
quand
le lien affich&eacute; est diff&eacute;rent du lien cible </li>
  <li>V&eacute;rification des noms de domaines masqu&eacute;s comme
http://%37icrosoft.com </li>
  <li>V&eacute;rification des URL dont le contenu fichier est
pr&eacute;sent
dans Bearwarn.txt (tests d'hame&ccedil;onnage) </li>
  <li>V&eacute;rification de l'appartenance de l'URL &agrave; la liste
noire
du service surbl.org </li>
</ul>
Si un probl&egrave;me est d&eacute;tect&eacute; un message vous en
avertira.
Cliquer sur OK lancera le navigateur. En cliquant sur Annuler l'URL
sera
m&eacute;moris&eacute;e pour le reste de la session de Pegasus Mail. Le
passage
du curseur de la souris au-dessus de l'URL le transformera en panneau
Stop.<br>
La v&eacute;rification de la liste noire se fait ou non selon la valeur
de
WantBl (Yes/No) dans le fichier BearHtml.ini. Cliquez sur le lien, la
ligne
d'&eacute;tat affichera le r&eacute;sultat.<br>
<h3>D&eacute;tection de tentative d'hame&ccedil;onnage</h3>
En plus de la v&eacute;rification de la liste noire, Bearhtml examine
&eacute;galement les hyper liens affich&eacute;s. Si des noms de
domaines connus appartenant &agrave; de entreprises commerciales
apparaissent ailleurs que dans la partie correcte de l'URL, un message
d'avertissement est affich&eacute;. Les utilisateurs peuvent
compl&eacute;ter la liste contenue dans le fichier Bearwarn.txt avec
leurs propres noms de domaine. Voir le fichier Bearwarn.txt pour plus
d'informations sur ce sujet.<br>
<h3>Scripting</h3>
Aucune forme de script tel que le Javascript n'est support&eacute;e.
Tout
codage de ce type dans un message est ignor&eacute; ce qui rend
l'affichage
de tels messages probl&egrave;matique. En cas de besoin le code HTML
doit
&ecirc;tre transmis &agrave; un navigateur.<br>
De plus toutes les demandes d'&eacute;criture ou de lecture de Cookies
sont
ignor&eacute;es.<br>
<h3>Impression<br>
</h3>
Pour l'instant Bearhtml ne peut pas imprimer les messages avec
l'information
d'enveloppe, il peut simplement imprimer la page HTML affich&eacute;e
sur
l'imprimante Windows par d&eacute;faut. Optionally the printer can be
changed by setting
the PrinterSetup= value to Yes in Bearhtml.ini.<br>
<h3>Styles</h3>
Les d&eacute;finitions de styles int&eacute;gr&eacute;es sont
trait&eacute;es.
Les styles situ&eacute;s sur des URL distantes ne sont pas
charg&eacute;s.<br>
<h3>Taille de police</h3>
L'augmentation ou la diminution de la taille de la police d'affichage
en
utilisant la touche Ctrl associ&eacute;e &agrave; la roulette de la
souris
peut ne pas fonctionner &agrave; tous les coups, et peut causer dans
certains
cas un affichage surprenant. Si un message poss&egrave;de
d&eacute;j&agrave;
des tailles de police int&eacute;gr&eacute;es elles sont prioritaires
sur
des tailles par d&eacute;faut. Certains messages ayant certaines
tailles
de police int&eacute;gr&eacute;es et d'autres laiss&eacute;es par
d&eacute;faut&nbsp;
peuvent appara&icirc;tre&nbsp; comme pauvrement format&eacute;s.
Veuillez
noter qu'il existe de multiples m&eacute;thodes pour ajuster la taille
des
polices &agrave; l'aide du clavier. <br>
<h3>Journalisation</h3>
Pour les probl&egrave;mes de maintenance un fichier journal peut
&ecirc;tre
cr&eacute;&eacute; dans le dossier de nouveau courrier de Pegasus Mail
(par
ex. c:\pmail\mail), c'est un fichier texte portant le nom de
Bearhtml.log
qui peut &ecirc;tre consult&eacute; &agrave; l'aide du Bloc-Notes.<br>
Dans le cas o&ugrave; il est fait appel &agrave; LibTidy pour tenter de
r&eacute;parer
du html, un fichier Beartidy.txt contenant le compte rendu de Tidy
pourra
&ecirc;tre trouv&eacute; dans le r&eacute;pertoire de nouveau courrier
de
l'utilisateur.<br>
<h3>D&eacute;lais <br>
</h3>
Bearhtml utilise les services Internet de Windows (WinInet.dll) pour
ex&eacute;cuter
ses recherches DNS et t&eacute;l&eacute;charger les pages web.
Occasionnellement
la connexion Internet peut ralentir ou les services DNS peuvent
d'arr&ecirc;ter.
Un d&eacute;lai de connexion est d&eacute;tect&eacute; par les services
Internet
Windows et Bearhtml en est inform&eacute; (la valeur par d&eacute;faut
est
de 60 secondes). La valeur de MaxFetchTime dans Bearhtml indique le
temps
maximum d'attente, il doit &ecirc;tre inf&eacute;rieur au d&eacute;lai
Windows. Si le temps de t&eacute;l&eacute;chargement d&eacute;passe la
valeur de MaxFetchTime
tous les t&eacute;l&eacute;chargements suivants pour ce message seront
arr&ecirc;t&eacute;s.<br>
<h3>D&eacute;placement dans la page <br>
</h3>
Il existe deux fa&ccedil;ons de se d&eacute;placer vers le haut ou vers
le bas dans une page web. Les ascenseurs sur le cot&eacute; de la
fen&ecirc;tre et les touches directionnelles du clavier. Les ascenseurs
utilisent toujours la fonction de Windows de d&eacute;placement d'un
certain nombre de pixels dans une direction ou dans l'autre, sans
prendre en compte la position du curseur.<br>
L'utilisation du clavier permet de se d&eacute;placer par lignes tout
en repositionnant le curseur texte. Dans ce cas la valeur du
d&eacute;placement peut &ecirc;tre facilement pr&eacute;visible, mais
dans le cas o&ugrave; du texte et des images sont
m&eacute;lang&eacute;s, la valeur du d&eacute;placement peut &ecirc;tre
difficile &agrave; pr&eacute;voir. Bearhtml essayera, par exemple, de
d&eacute;placer le curseur vers le haut ou vers le bas d'un nombre de
pixels correspondant &agrave; une hauteur de page et essayera de
trouver une ligne de texte totalement affich&eacute;e pour y placer le
curseur.<br>
<h3>Redirection</h3>
Le protocole Http permet qu'une requ&ecirc;te vers une Url soit
modif&eacute;e par le serveur web pour aller chercher un objet (page ou
image) &agrave; un autre emplacement. Bearhtml peut accepter cette
fonctionnalit&eacute; mais par d&eacute;faut&nbsp; elle est
d&eacute;sactiv&eacute;e. Il faut prendre garde &agrave; activer la
redirection. La description des risques encourus n'est pas l'objet de
ce fichier. Faites une recherche sur Google telle que :
http://computing-dictionary.thefreedictionary.com/Http+redirection
<h3>Installation</h3>
<ol>
  <li>Fermez Pegasus Mail </li>
  <li>D&eacute;compressez le contenu de l'archive bearhtml.zip dans le
r&eacute;pertoire
de l'ex&eacute;cutable Pegasus Mail (par exemple c:\pmail). </li>
  <li>Si n&eacute;cessaire, &eacute;ditez Bearhtml.ini et Bearwarn.txt </li>
  <li>Si n&eacute;cessaire, sauvegardez Bearhtml.ini dans le
r&eacute;pertoire
de nouveau courrier de l'utilisateur pour &eacute;craser les valeurs
d'origine </li>
  <li>Relancez Pegasus Mail </li>
</ol>
<h3>D&eacute;sinstallation</h3>
<ol>
  <li>Fermez Pegasus Mail </li>
  <li>Renommez ou suprimez Bearhtml.dll </li>
  <li>Relancez Pegasus Mail </li>
</ol>
<a id="Parameter" name="Parameter">
<h3>Contenu de Bearhtml.ini</h3>
</a>
<ul>
  <li>ScrollPixels= (d&eacute;faut 20) nombre de pixels de
d&eacute;calage
avec la roulette de la souris </li>
  <li>ScrollRepeat= (d&eacute;faut 1) r&eacute;p&eacute;tition du
d&eacute;calage
de la roulette de la souris </li>
  <li>ScrollDelayMs= (d&eacute;faut 1 ms) delai entre 2 actions sur la
roulette
de la souris </li>
  <li>DefaultFontSize= (d&eacute;faut 12) Taille d'affichage de la
police
par d&eacute;faut </li>
  <li>DefaultFontName= (d&eacute;faut Arial) Police par d&eacute;faut<br>
  </li>
  <li>WantBl= (d&eacute;faut No, Yes/No) V&eacute;rification de la
liste
noire </li>
  <li>WantCache= (d&eacute;faut Yes, Yes/No) Sauvegarde les images dans
le
sous-r&eacute;pertoire RmtFiles du r&eacute;pertoire de courrier </li>
  <li>LocalIPAddress= (d&eacute;faut No) utilis&eacute; pour
&eacute;viter
que les adresses locales du type 127.0.0.1 ne causent des fausses
alertes
d'hame&ccedil;onnage, plusieurs adresses s&eacute;par&eacute;es par des
virgules. Par exemple localIPAddress=127.0.0,192.168 exclut les plages
d'adresses 127.0.0.x et 192.168.y.z. </li>
  <li>MaxFetchTime= (d&eacute;faut 25) temps maximum acceptable de
t&eacute;l&eacute;chargement,
en secondes (voir ci-dessus : D&eacute;lais)<br>
  </li>
  <li>CheckUTF8= (d&eacute;faut false) Recherche de l'en-t&ecirc;te du
jeu
de
caract&egrave;res MIME UTF8 </li>
  <li>Redirection= (d&eacute;faut false) redirection Http vers une Url
situ&eacute;e &agrave; un autre emplacement (risqu&eacute;)</li>
  <li>PrinterSetup= (d&eacute;faut No) Permet la s&eacute;lection de
l'imprimante lors de l'impression d'une page html</li>
  <li>Loglevel= (d&eacute;faut 3) Utilise le m&ecirc;me degr&eacute; de
journalisation que Pegasus Mail, soit :<br>
    <table border="1">
      <tbody>
        <tr>
          <td>Loglevel=1 Signale les erreurs critiques des fonctions de
Bearhtml</td>
        </tr>
        <tr>
          <td>Loglevel=2 Idem Loglevel=1 ainsi que les erreurs
s&eacute;rieuses<br>
          </td>
        </tr>
        <tr>
          <td>Loglevel=3 Idem Loglevel=1/2 ainsi que les
&eacute;v&eacute;nements normaux<br>
          </td>
        </tr>
        <tr>
          <td>Loglevel=4 Idem Loglevel 1/2/3 ainsi que les informations
d&eacute;taill&eacute;es de transactions</td>
        </tr>
      </tbody>
    </table>
  </li>
</ul>
<ul>
  <br>
  <i>Les utilisateurs de Windows 95 ont un jeu de caract&egrave;res
limit&eacute; et doivent d&eacute;finir CheckUTF8=false dans
Bearhtml.ini.</i>
</ul>
<h3>Copyrights</h3>
<ul>
  <li>HtmlViewer: David Baldwin (<a href="http://www.pbear.com">http://www.pbear.com</a>)
  </li>
  <li>Pegasus Mail: David Harris (<a href="http://www.pmail.com">http://www.pmail.com</a>)
  </li>
  <li>Tidy: LibTidy-Project(<a href="http://tidy.sourceforge.net">http://tidy.sourceforge.net</a>
and <a href="http://www.w3c.org">http://www.w3c.org</a>) </li>
  <li>BearHtml: Martin Ireland (<a
 href="mailto:martin.ireland@gov.ab.ca">mailto:martin.ireland@gov.ab.ca</a>)
  </li>
  <li>ReadWebData: Michael in der Wiesche </li>
</ul>
<br>
</body>
</html>
